![png](Data/ERD_Chinook.png)

In [2]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'root' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
engine = create_engine(connection)

In [3]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

   Tables_in_chinook
0              album
1             artist
2           customer
3           employee
4              genre
5            invoice
6        invoiceline
7          mediatype
8           playlist
9      playlisttrack
10             track

# What is the most a customer has spent on a single purchase and what is their customerId?

In [6]:
q = '''select * from customer limit 1'''
pd.read_sql(q,engine)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3

In [7]:
q = '''select * from invoice limit 1'''
pd.read_sql(q,engine)

,InvoiceId,CustomerId,InvoiceDate,BillingAddress,BillingCity,BillingState,BillingCountry,BillingPostalCode,Total
0,1,2,2009-01-01,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,1.98

In [9]:
# q = '''select customerid, Total from invoice order by total desc limit 1'''
pd.read_sql(q,engine)

   customerid  Total
0           6  25.86

# What country is the customer with the largest total bill from (from question 2)?

In [10]:
q = '''select customerid, billingcountry, sum(Total) Total from invoice group by customerid, billingcountry order by sum(total) desc limit 1'''
pd.read_sql(q,engine)

   customerid  billingcountry  Total
0           6  Czech Republic  49.62

# Which customerID made the fewest purchases (invoices)?

In [12]:
q = '''select customerid, count(invoiceid) from invoice group by customerid order by count(invoiceid) asc  limit 1'''
pd.read_sql(q,engine)

   customerid  count(invoiceid)
0          59                 6

# Retrieve the id, name, and # of playlists for tracks that appear on playlists more than 4 times?